In [5]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [6]:
df = pd.read_csv("Dataset salary 2024.csv")

In [11]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,salary_ranges
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M,200K-300K
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M,100K and Below
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M,100K-200K
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M,100K and Below
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M,100K-200K

In [12]:
df.shape

(16534, 12)

In [13]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
salary_ranges         object
dtype: object

In [14]:
df.describe()

          work_year        salary  salary_in_usd  remote_ratio
count  16534.000000  1.653400e+04   16534.000000  16534.000000
mean    2023.226866  1.637270e+05  149686.777973     32.003750
std        0.713558  3.402057e+05   68505.293156     46.245158
min     2020.000000  1.400000e+04   15000.000000      0.000000
25%     2023.000000  1.017630e+05  101125.000000      0.000000
50%     2023.000000  1.422000e+05  141300.000000      0.000000
75%     2024.000000  1.872000e+05  185900.000000    100.000000
max     2024.000000  3.040000e+07  800000.000000    100.000000

In [15]:
pd.isnull(df).sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
salary_ranges         0
dtype: int64

In [16]:
df['salary_in_usd'].max()

800000

In [17]:
df['salary_in_usd'].min()

15000

In [18]:
def calculateSalaryRanges(salary):
    if salary <= 100000:
        return '100K and Below'
    if salary > 100000 and salary <= 200000:
        return '100K-200K'
    if salary > 200000 and salary <= 300000:
        return '200K-300K'
    if salary > 300000 and salary <= 400000:
        return '300K-400K'
    if salary > 400000 and salary <= 500000:
        return '400K-500K'
    if salary > 500000 and salary <= 600000:
        return '500K-600K'
    if salary > 600000 and salary <= 700000:
        return '600K-700K'
    if salary > 700000 and salary <= 800000:
        return '700K-800K'
    return'other'

In [19]:
df['salary_ranges'] = df['salary_in_usd'].apply(calculateSalaryRanges)

In [20]:
salary_ranges.value_counts()

NameError: name 'salary_ranges' is not defined

In [21]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,salary_ranges
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M,200K-300K
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M,100K and Below
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M,100K-200K
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M,100K and Below
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M,100K-200K

In [22]:
df.to_csv('New_Dataset_Salary_2024.csv', index=False)

In [23]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\asus vivobook\anaconda3\lib\site-packages (2.0.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\asus vivobook\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\asus vivobook\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [25]:
from sqlalchemy import create_engine

# connect to PostgresSQL
username = "postgres"
password = "admin123"
host = "localhost"
port = "5432"
database = "postgres"

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

#load dataset into postgresql
table_name = "salary"
df.to_sql(table_name, engine, if_exists="replace", index=False)
print(f"data successfully loaded into table '{table_name}' in database '{database}'.")

data successfully loaded into table 'salary' in database 'postgres'.